{-# OPTIONS --without-K #-}

open import Lib

{-
Definition of the -ᴬ, -ᴰ, -ᴹ and -ˢ translations on the syntax.

All four operations are defined in a single model, i.e. with
non-dependent recursion on the syntax. This is for technical reasons;
it is much easier in current Agda to define a single model with
multiple components than to define multiple models possibly depending
on each other.

So, if you look at the interpretation of contexts below, you see

  Con : Set i
  Con =
     ∃ λ (Γᴬ : Set₁) →
     ∃ λ (Γᴰ : Γᴬ → Set (lsuc ℓ)) →
     ∃ λ (Γᴹ : Γᴬ → Γᴬ → Set ℓ)  →
         ((γ : Γᴬ) → Γᴰ γ → Set ℓ)

which is a Σ with four components, for algebras, displayed algebras,
homomorphisms, and displayed algebra sections.

Likewise, we interpret the other sorts as Σ-s of four components.

You can find some unreadable large type signatures here. Don't try to
read them, just look at the DeepSourceSyntax.agda file for the short
and comprehensible types. The large garbled types are just the
DeepSourceSyntax.agda types with printing of implicit arguments turned
on. We use these types because Agda can't reliably infer the implicit
arguments, and it's easier to just print out the whole explicit type
than to try and annotate manually.

-}

module DeepADMS (ℓ : Level) where

infixl 5 _▶_
infixl 7 _[_]T
infixl 5 _,s_
infix  6 _∘_
infixl 8 _[_]t

-- Universe level we eliminate into
--------------------------------------------------------------------------------

i : Level
i = suc (suc ℓ)

j : Level
j = suc ℓ

-- Base CwF (category with families), i.e. the explicit substitution calculus
--------------------------------------------------------------------------------

Con =
   ∃ λ (Γᴬ : Set₁) →
   ∃ λ (Γᴰ : Γᴬ → Set (suc ℓ)) →
   ∃ λ (Γᴹ : Γᴬ → Γᴬ → Set ℓ)  →
       ((γ : Γᴬ) → Γᴰ γ → Set ℓ)

Ty : Con → Set i
Ty (Γᴬ , Γᴰ , Γᴹ , Γˢ) =
   ∃ λ (Aᴬ : Γᴬ → Set₁) →
   ∃ λ (Aᴰ : (γ : Γᴬ) → Γᴰ γ → Aᴬ γ → Set (suc ℓ)) →
   ∃ λ (Aᴹ : (γ₀ γ₁ : Γᴬ) → Γᴹ γ₀ γ₁ → Aᴬ γ₀ → Aᴬ γ₁ → Set ℓ) →
             (γ : Γᴬ)(γᴰ : Γᴰ γ)(γˢ : Γˢ γ γᴰ)(α : Aᴬ γ) → Aᴰ γ γᴰ α → Set ℓ

Tm : ∀ Γ → Ty Γ → Set j
Tm (Γᴬ , Γᴰ , Γᴹ , Γˢ) (Aᴬ , Aᴰ , Aᴹ , Aˢ) =
  ∃ λ (tᴬ : (γ : Γᴬ) → Aᴬ γ) →
  ∃ λ (tᴰ : (γ : Γᴬ)(γᴰ : Γᴰ γ) → Aᴰ γ γᴰ (tᴬ γ)) →
  ∃ λ (tᴹ : (γ₀ γ₁ : Γᴬ)(γᴹ : Γᴹ γ₀ γ₁) → Aᴹ γ₀ γ₁ γᴹ (tᴬ γ₀) (tᴬ γ₁)) →
            (γ : Γᴬ)(γᴰ : Γᴰ γ)(γˢ : Γˢ γ γᴰ) → Aˢ γ γᴰ γˢ (tᴬ γ) (tᴰ γ γᴰ)

Sub : Con → Con → Set j
Sub (Γᴬ , Γᴰ , Γᴹ , Γˢ) (Δᴬ , Δᴰ , Δᴹ , Δˢ) =
  ∃ λ (σᴬ : Γᴬ → Δᴬ) →
  ∃ λ (σᴰ : (γ : Γᴬ) → Γᴰ γ → Δᴰ (σᴬ γ)) →
  ∃ λ (σᴹ : (γ₀ γ₁ : Γᴬ)(γᴹ : Γᴹ γ₀ γ₁) → Δᴹ (σᴬ γ₀) (σᴬ γ₁)) →
            (γ : Γᴬ)(γᴰ : Γᴰ γ)(γˢ : Γˢ γ γᴰ) → Δˢ (σᴬ γ) (σᴰ γ γᴰ)

∙ : Con
∙ =
  Lift ⊤ ,
  (λ _ → Lift ⊤) ,
  (λ _ _ → Lift ⊤) ,
  (λ _ _ → Lift ⊤)

_▶_ : (Γ : Con) → Ty Γ → Con
(Γᴬ , Γᴰ , Γᴹ , Γˢ) ▶ (Aᴬ , Aᴰ , Aᴹ , Aˢ) =
  Σ Γᴬ Aᴬ ,
  (λ {(γ , α) → Σ (Γᴰ γ) λ γᴰ → Aᴰ γ γᴰ α}) ,
  (λ {(γ₀ , α₀)(γ₁ , α₁) → Σ (Γᴹ γ₀ γ₁) λ γᴹ → Aᴹ _ _ γᴹ α₀ α₁}) ,
  (λ {(γ , α)(γᴰ , αᴰ) → Σ (Γˢ γ γᴰ) λ γˢ → Aˢ _ _ γˢ α αᴰ})

_[_]T : ∀{Γ Δ} → Ty Δ → Sub Γ Δ → Ty Γ
_[_]T (Aᴬ , Aᴰ , Aᴹ , Aˢ) (σᴬ , σᴰ , σᴹ , σˢ) =
  (λ γ → Aᴬ (σᴬ γ)) ,
  (λ γ γᴰ α → Aᴰ (σᴬ γ) (σᴰ γ γᴰ) α) ,
  (λ γ₀ γ₁ γᴹ α₀ α₁ → Aᴹ (σᴬ γ₀) (σᴬ γ₁) (σᴹ γ₀ γ₁ γᴹ) α₀ α₁) ,
  (λ γ γᴰ γˢ α αᴰ → Aˢ (σᴬ γ) (σᴰ γ γᴰ) (σˢ γ γᴰ γˢ) α αᴰ)

id : ∀{Γ} → Sub Γ Γ
id {Γᴬ , Γᴰ , Γᴹ , Γˢ} =
  (λ γ → γ) ,
  (λ _ γᴰ → γᴰ) ,
  (λ _ _ γᴹ → γᴹ) ,
  (λ _ _ γˢ → γˢ)

_∘_ : ∀{Γ Δ Σ} → Sub Δ Σ → Sub Γ Δ → Sub Γ Σ
(σᴬ , σᴰ , σᴹ , σˢ) ∘ (δᴬ , δᴰ , δᴹ , δˢ) =
  (λ γ → σᴬ (δᴬ γ)) ,
  (λ γ γᴰ → σᴰ (δᴬ γ) (δᴰ γ γᴰ)) ,
  (λ γ₀ γ₁ γᴹ → σᴹ (δᴬ γ₀) (δᴬ γ₁) (δᴹ γ₀ γ₁ γᴹ)) ,
  (λ γ γᴰ γˢ → σˢ (δᴬ γ) (δᴰ γ γᴰ) (δˢ γ γᴰ γˢ))

ε : ∀{Γ} → Sub Γ ∙
ε {Γ} =
  (λ _ → lift tt) ,
  (λ _ _ → lift tt) ,
  (λ _ _ _ → lift tt) ,
  (λ _ _ _ → lift tt)

_,s_ : ∀{Γ Δ A}(σ : Sub Γ Δ) → Tm Γ (A [ σ ]T) → Sub Γ (Δ ▶ A)
_,s_ {Γ}{Δ}{A} (σᴬ , σᴰ , σᴹ , σˢ) (tᴬ , tᴰ , tᴹ , tˢ) =
  (λ γ → σᴬ γ , tᴬ γ) ,
  (λ γ γᴰ → σᴰ γ γᴰ , tᴰ γ γᴰ) ,
  (λ γ₀ γ₁ γᴹ → σᴹ γ₀ γ₁ γᴹ , tᴹ γ₀ γ₁ γᴹ) ,
  (λ γ γᴰ γˢ → σˢ γ γᴰ γˢ , tˢ γ γᴰ γˢ)

π₁ : ∀{Γ Δ}{A : Ty Δ} → Sub Γ (Δ ▶ A) →  Sub Γ Δ
π₁ (σᴬ , σᴰ , σᴹ , σˢ) =
  (λ γ → ₁ (σᴬ γ)) ,
  (λ γ γᴰ → ₁ (σᴰ γ γᴰ)) ,
  (λ γ₀ γ₁ γᴹ → ₁ (σᴹ γ₀ γ₁ γᴹ)) ,
  (λ γ γᴰ γˢ → ₁ (σˢ γ γᴰ γˢ))

_[_]t : ∀{Γ Δ}{A : Ty Δ} → Tm Δ A → (σ : Sub Γ Δ) → Tm Γ (A [ σ ]T)
_[_]t (tᴬ , tᴰ , tᴹ , tˢ) (σᴬ , σᴰ , σᴹ , σˢ) =
  (λ γ → tᴬ (σᴬ γ)) ,
  (λ γ γᴰ → tᴰ (σᴬ γ) (σᴰ γ γᴰ)) ,
  (λ γ₀ γ₁ γᴹ → tᴹ (σᴬ γ₀) (σᴬ γ₁) (σᴹ γ₀ γ₁ γᴹ)) ,
  (λ γ γᴰ γˢ → tˢ (σᴬ γ) (σᴰ γ γᴰ) (σˢ γ γᴰ γˢ))

π₂ : ∀{Γ Δ}{A : Ty Δ}(σ : Sub Γ (Δ ▶ A))
   → Tm Γ (_[_]T {Γ} {Δ} A (π₁ {Γ} {Δ} {A} σ))
π₂ (σᴬ , σᴰ , σᴹ , σˢ) =
  (λ γ → ₂ (σᴬ γ)) ,
  (λ γ γᴰ → ₂ (σᴰ γ γᴰ)) ,
  (λ γ₀ γ₁ γᴹ → ₂ (σᴹ γ₀ γ₁ γᴹ)) ,
  (λ γ γᴰ γˢ → ₂ (σˢ γ γᴰ γˢ))

[id]T : ∀{Γ}{A : Ty Γ} → A [ id ]T ≡ A
[id]T = refl

[][]T : ∀{Γ Δ Σ}{A : Ty Σ}{σ : Sub Γ Δ}{δ : Sub Δ Σ}
        → (_[_]T {Γ} {Δ} (_[_]T {Δ} {Σ} A δ) σ)
          ≡
          (_[_]T {Γ} {Σ} A (_∘_ {Γ} {Δ} {Σ} δ σ))
[][]T {Γ} {Δ} {Σ} {A} {σ} {δ} = refl

idl : {Γ Δ : Con} {δ : Sub Γ Δ} → (_∘_ {Γ} {Δ} {Δ} (id {Δ}) δ) ≡ δ
idl = refl

idr : {Γ Δ : Con} {δ : Sub Γ Δ} → (_∘_ {Γ} {Γ} {Δ} δ (id {Γ})) ≡ δ
idr = refl

ass : ∀{Γ Δ Σ Ω}{σ : Sub Σ Ω}{δ : Sub Δ Σ}{ν : Sub Γ Δ}
      → (_∘_ {Γ} {Δ} {Ω} (_∘_ {Δ} {Σ} {Ω} σ δ) ν)
        ≡
        (_∘_ {Γ} {Σ} {Ω} σ (_∘_ {Γ} {Δ} {Σ} δ ν))
ass = refl

,∘ : ∀{Γ Δ Σ}{δ : Sub Γ Δ}{σ : Sub Σ Γ}{A : Ty Δ}{t : Tm Γ (A [ δ ]T)}
      → (_∘_ {Σ}{Γ}{Δ ▶ A} (_,s_ {Γ}{Δ}{A} δ t) σ) ≡
        (_,s_ {Σ}{Δ}{A}(_∘_ {Σ}{Γ}{Δ} δ σ)(tr (Tm Σ) ([][]T {Σ}{Γ}{Δ}{A}{σ}{δ}) (_[_]t {Σ}{Γ}{A [ δ ]T} t σ)))
,∘ = refl

π₁β : ∀{Γ Δ}{A : Ty Δ}{δ : Sub Γ Δ}{a : Tm Γ (A [ δ ]T)}
      → (π₁ {Γ}{Δ}{A}(_,s_ {Γ}{Δ}{A} δ a)) ≡ δ
π₁β = refl

πη : ∀{Γ Δ}{A : Ty Δ}{δ : Sub Γ (Δ ▶ A)}
      → _,s_ {Γ}{Δ}{A}(π₁ {Γ}{Δ}{A} δ)(π₂ {Γ}{Δ}{A} δ) ≡ δ
πη = refl

εη : ∀{Γ}{σ : Sub Γ ∙}
      → σ ≡ ε
εη = refl

π₂β : ∀{Γ Δ}{A : Ty Δ}{δ : Sub Γ Δ}{a : Tm Γ (A [ δ ]T)}
      → tr (λ x → Tm Γ (A [ x ]T)) (π₁β {Γ}{Δ}{A}{δ}{a}) (π₂ {Γ}{Δ}{A}(_,s_ {Γ}{Δ}{A} δ a)) ≡ a
π₂β = refl

wk : ∀{Γ}{A : Ty Γ} → Sub (Γ ▶ A) Γ
wk {Γ}{A} = π₁ {Γ ▶ A}{Γ}{A} id

vz : ∀{Γ}{A : Ty Γ} → Tm (Γ ▶ A) (A [ wk ]T)
vz {Γ}{A} = π₂ {Γ ▶ A}{Γ}{A} id

vs : ∀{Γ}{A B : Ty Γ} → Tm Γ A → Tm (Γ ▶ B) (A [ wk ]T)
vs {Γ}{A}{B} x = _[_]t {Γ ▶ B}{Γ}{A} x (wk {Γ}{B})

<_> : ∀{Γ}{A : Ty Γ} → Tm Γ A → Sub Γ (Γ ▶ A)
<_> {Γ}{A} t = _,s_ {Γ}{Γ}{A} id (tr (Tm Γ) ([id]T {Γ}{A} ⁻¹) t)

infix 4 <_>

_^_ : {Γ Δ : Con}(σ : Sub Γ Δ)(A : Ty Δ) → Sub (Γ ▶ A [ σ ]T) (Δ ▶ A)
_^_ {Γ}{Δ} σ A =
  _,s_ {Γ ▶ A [ σ ]T}{Δ}{A}
       (_∘_ {Γ ▶ A [ σ ]T}{Γ}{Δ} σ wk)
       (tr (Tm (Γ ▶ A [ σ ]T)) ([][]T {Γ ▶ A [ σ ]T}{Γ}{Δ}{A}{wk{Γ}{A [ σ ]T}}{σ}) vz)

infixl 5 _^_

-- Universe
--------------------------------------------------------------------------------

U : ∀{Γ} → Ty Γ
U {Γᴬ , Γᴰ , Γᴹ , Γˢ} =
  (λ _ → Set) ,
  (λ _ _ T → T → Set ℓ) ,
  (λ _ _ _ α₀ α₁ → Lift (α₀ → α₁)) ,
  (λ _ _ _ T Tᴰ → (α : T) → Tᴰ α)

U[] : ∀{Γ Δ}{σ : Sub Γ Δ} → _[_]T {Γ}{Δ} U σ ≡ U
U[] = refl

El : ∀{Γ}(a : Tm Γ U) → Ty Γ
El (aᴬ , aᴰ , aᴹ , aˢ) =
  (λ γ → Lift (aᴬ γ)) ,
  (λ {γ γᴰ (lift α) → Lift (aᴰ γ γᴰ α)}) ,
  (λ {γ₀ γ₁ γᴹ (lift α₀) (lift α₁) → Lift (lower (aᴹ _ _ γᴹ) α₀ ≡ α₁)}) ,
  (λ {γ γᴰ γˢ (lift α) (lift αᴰ) → aˢ γ γᴰ γˢ α ≡ αᴰ})

El[] : ∀{Γ Δ}{σ : Sub Γ Δ}{a : Tm Δ U}
     → El a [ σ ]T ≡ El (tr (Tm Γ) (U[] {Γ}{Δ}{σ}) (_[_]t {Γ}{Δ}{U} a σ))
El[] = refl
{-
-- Inductive functions
--------------------------------------------------------------------------------

Π : ∀{Γ}(a : Tm Γ U)(B : Ty (Γ ▶ El a)) → Ty Γ
Π (aᴬ , aᴰ , aᴹ , aˢ) (Bᴬ , Bᴰ , Bᴹ , Bˢ) =
  (λ γ → (α : aᴬ γ) → Bᴬ (γ , lift α)) ,
  (λ γ γᴰ f → (α : aᴬ γ)(αᴰ : aᴰ γ γᴰ α) → Bᴰ (γ , lift α) (γᴰ , lift αᴰ) (f α)) ,
  (λ γ₀ γ₁ γᴹ f₀ f₁ → (α : aᴬ γ₀) → Bᴹ _ _ (γᴹ , lift refl) (f₀ α) (f₁ (lower (aᴹ _ _ γᴹ) α))) ,
  (λ γ γᴰ γˢ f fᴰ → (α : aᴬ γ) → Bˢ _ (γᴰ , lift (aˢ γ γᴰ γˢ α)) (γˢ , refl)
                                      (f α) (fᴰ α (aˢ γ γᴰ γˢ α)))

Π[] : ∀{Γ Δ}{σ : Sub Γ Δ}{a : Tm Δ U}{B : Ty (Δ ▶ El a)}
    → (Π a B) [ σ ]T ≡ Π (tr (Tm Γ) (U[] {Γ}{Δ}{σ}) (_[_]t {Γ}{Δ}{U} a σ))
                         (tr (λ x → Ty (Γ ▶ x)) (El[] {σ = σ}{a}) (B [ σ ^ El a ]T))
Π[] = refl

app : ∀{Γ}{a : Tm Γ U}{B : Ty (Γ ▶ El a)} → Tm Γ (Π a B) → Tm (Γ ▶ El a) B
app {Γᴬ , Γᴰ , Γᴹ , Γˢ}{aᴬ , aᴰ , aᴹ , aˢ}{Bᴬ , Bᴰ , Bᴹ , Bˢ}(tᴬ , tᴰ , tᴹ , tˢ) =
  (λ {(γ , lift α) → tᴬ γ α}) ,
  (λ {(γ , lift α) (γᴰ , lift αᴰ) → tᴰ γ γᴰ α αᴰ}) ,
  (λ {(γ₀ , lift α₀)(γ₁ , lift α₁)(γᴹ , lift αᴹ) →
     J (λ α₁ αᴹ → Bᴹ _ _ (γᴹ , lift αᴹ) (tᴬ γ₀ α₀) (tᴬ γ₁ α₁))
       (tᴹ _ _ γᴹ  α₀) αᴹ}) ,
  (λ {(γ , lift α) (γᴰ , lift αᴰ)(γˢ , αˢ) →
    J (λ αᴰ αˢ → Bˢ _ (γᴰ , lift αᴰ) (γˢ , αˢ) (tᴬ γ α) (tᴰ γ γᴰ α αᴰ))
       (tˢ γ γᴰ γˢ α)
       αˢ})

app[] : {Γ Δ : Con} {σ : Sub Γ Δ} {a : Tm Δ (U {Δ})}
        {B : Ty (Δ ▶ El {Δ} a)} {t : Tm Δ (Π {Δ} a B)} → _≡_ {j}
        {Tm (Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ}
        (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U
        {Δ}} a σ))) (tr {i} {i} {Ty Γ} (λ z → Ty (Γ ▶ z)) {_[_]T
        {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ)
        {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t
        {Γ} {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a}) (_[_]T {Γ ▶
        _[_]T {Γ} {Δ} (El {Δ} a) σ} {Δ ▶ El {Δ} a} B (_^_ {Γ} {Δ}
        σ (El {Δ} a))))} (tr2 {i} {i} {j} {Ty Γ} {λ z → Ty (Γ ▶
        z)} (λ A → Tm (Γ ▶ A)) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El
        {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U
        {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[]
        {Γ} {Δ} {σ} {a}) {_[_]T {Γ ▶ _[_]T {Γ} {Δ} (El {Δ} a) σ}
        {Δ ▶ El {Δ} a} B (_^_ {Γ} {Δ} σ (El {Δ} a))} {tr {i} {i}
        {Ty Γ} (λ z → Ty (Γ ▶ z)) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El
        {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U
        {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[]
        {Γ} {Δ} {σ} {a}) (_[_]T {Γ ▶ _[_]T {Γ} {Δ} (El {Δ} a) σ}
        {Δ ▶ El {Δ} a} B (_^_ {Γ} {Δ} σ (El {Δ} a)))} refl (_[_]t
        {Γ ▶ _[_]T {Γ} {Δ} (El {Δ} a) σ} {Δ ▶ El {Δ} a} {B} (app
        {Δ} {a} {B} t) (_^_ {Γ} {Δ} σ (El {Δ} a)))) (app {Γ} {tr
        {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}}
        (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ)} {tr {i} {i}
        {Ty Γ} (λ x → Ty (Γ ▶ x)) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El
        {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U
        {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[]
        {Γ} {Δ} {σ} {a}) (_[_]T {Γ ▶ _[_]T {Γ} {Δ} (El {Δ} a) σ}
        {Δ ▶ El {Δ} a} B (_^_ {Γ} {Δ} σ (El {Δ} a)))} (tr {i} {j}
        {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (Π {Δ} a B) σ} {Π {Γ} (tr {i}
        {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[]
        {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ)) (tr {i} {i} {Ty
        Γ} (λ x → Ty (Γ ▶ x)) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El {Γ}
        (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U
        {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[]
        {Γ} {Δ} {σ} {a}) (_[_]T {Γ ▶ _[_]T {Γ} {Δ} (El {Δ} a) σ}
        {Δ ▶ El {Δ} a} B (_^_ {Γ} {Δ} σ (El {Δ} a))))} (Π[] {Γ}
        {Δ} {σ} {a} {B}) (_[_]t {Γ} {Δ} {Π {Δ} a B} t σ)))
app[] {Γ}{Δ}{σ}{a}{B}{t} = refl


-- Non-inductive functions
--------------------------------------------------------------------------------

ΠNI : ∀ {Γ}(A : Set) → (A → Ty Γ) → Ty Γ
ΠNI {Γᴬ , Γᴰ , Γᴹ , Γˢ} A B =
  (λ γ            → (α : A) → B α .₁ γ) ,
  (λ γ γᴰ f       → (α : A) → B α .₂ .₁ γ γᴰ (f α)) ,
  (λ γ₀ γ₁ γᴹ f₀ f₁ → (α : A) → B α .₂ .₂ .₁ _ _ γᴹ (f₀ α) (f₁ α)) ,
  (λ γ γᴰ γˢ f fᴰ → (α : A) → B α .₂ .₂ .₂ γ γᴰ γˢ (f α) (fᴰ α))

ΠNI[] : ∀ {Γ Δ}{σ : Sub Γ Δ}{A : Set}{B : A → Ty Δ}
        → ΠNI A B [ σ ]T ≡ ΠNI A (λ α → B α [ σ ]T)
ΠNI[] = refl

appNI : ∀ {Γ}{A}{B : A → Ty Γ} → Tm Γ (ΠNI A B) → (∀ α → Tm Γ (B α))
appNI t α =
  (λ γ → t .₁ γ α) ,
  (λ γ γᴰ → t .₂ .₁ γ γᴰ α) ,
  (λ γ₀ γ₁ γᴹ → t .₂ .₂ .₁ _ _ γᴹ α) ,
  (λ γ γᴰ γˢ → t. ₂ .₂ .₂ _ _ γˢ α)

appNI[] :
  {Γ Δ : Con} {σ : Sub Γ Δ} {A : Set} {B : A → Ty Δ}
  (t : Tm Δ (ΠNI {Δ} A B)) (α : A) →
  _≡_ {_} {Tm Γ (_[_]T {Γ} {Δ} (B α) σ)}
  (_[_]t {Γ} {Δ} {B α} (appNI {Δ} {A} {B} t α) σ)
  (appNI {Γ} {A} {λ α₁ → _[_]T {Γ} {Δ} (B α₁) σ}
   (tr {_} {_} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (ΠNI {Δ} A B) σ}
    {ΠNI {Γ} A (λ α₁ → _[_]T {Γ} {Δ} (B α₁) σ)}
    (ΠNI[] {Γ} {Δ} {σ} {A} {B}) (_[_]t {Γ} {Δ} {ΠNI {Δ} A B} t σ))
   α)
appNI[] t α = refl


-- Small non-inductive functions (infinitary parameters)
--------------------------------------------------------------------------------

Πₙᵢ : ∀ {Γ}(A : Set) → (A → Tm Γ U) → Tm Γ U
Πₙᵢ {Γᴬ , Γᴰ , Γᴹ , Γˢ} A b =
  (λ γ → (α : A) → b α .₁ γ) ,
  (λ γ γᴰ f → (α : A) → b α .₂ .₁ γ γᴰ (f α)) ,
  (λ γ₀ γ₁ γᴹ → lift (λ f α → b α .₂ .₂ .₁ _ _ γᴹ .lower (f α))) ,
  (λ γ γᴰ γˢ f α → b α .₂ .₂ .₂ γ γᴰ γˢ (f α))

Πₙᵢ[] :
  {Γ Δ : Con} {σ : Sub Γ Δ} {A : Set} {b : A → Tm Δ (U {Δ})} →
  _≡_
    (tr (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}}
      (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} (Πₙᵢ {Δ} A b) σ))
  (Πₙᵢ {Γ} A
   (λ α →
      tr (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}}
      (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} (b α) σ)))
Πₙᵢ[] = refl

appₙᵢ : ∀ {Γ}{A}{b : A → Tm Γ U} → Tm Γ (El (Πₙᵢ A b)) → (∀ α → Tm Γ (El (b α)))
appₙᵢ (tᴬ , tᴰ , tᴹ , tˢ) α =
  (λ γ → lift (tᴬ γ .lower α)) ,
  (λ γ γᴰ → lift (tᴰ γ γᴰ .lower α)) ,
  (λ γ₀ γ₁ γᴹ → lift (ap (λ f → f α) (tᴹ _ _ γᴹ .lower))) ,
  (λ γ γᴰ γˢ → ap (λ f → f α) (tˢ γ γᴰ γˢ))

appₙᵢ[] :
  {Γ Δ : Con} {σ : Sub Γ Δ} {A : Set} {b : A → Tm Δ (U {Δ})} (t : Tm Δ
  (El {Δ} (Πₙᵢ {Δ} A b))) (α : A) → _≡_ {_} {Tm Γ (El {Γ} (tr {_}
  {_} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ}
  {σ}) (_[_]t {Γ} {Δ} {U {Δ}} (b α) σ)))} (tr {_} {_} {Ty Γ} (Tm
  Γ) {_[_]T {Γ} {Δ} (El {Δ} (b α)) σ} {El {Γ} (tr {_} {_} {Ty Γ}
  (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ}
  {Δ} {U {Δ}} (b α) σ))} (El[] {Γ} {Δ} {σ} {b α}) (_[_]t {Γ} {Δ} {El {Δ}
  (b α)} (appₙᵢ {Δ} {A} {b} t α) σ)) (appₙᵢ {Γ} {A} {λ α₁ → tr {_}
  {_} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ}
  {σ}) (_[_]t {Γ} {Δ} {U {Δ}} (b α₁) σ)} (tr {_} {_} {Ty Γ} (Tm Γ)
  {_[_]T {Γ} {Δ} (El {Δ} (Πₙᵢ {Δ} A b)) σ} {El {Γ} (Πₙᵢ {Γ} A (λ α₁ → tr
  {_} {_} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ}
  {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} (b α₁) σ)))} (_◾_ {_} {Ty Γ}
  {_[_]T {Γ} {Δ} (El {Δ} (Πₙᵢ {Δ} A b)) σ} {El {Γ} (tr {_} {_} {Ty
  Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t
  {Γ} {Δ} {U {Δ}} (Πₙᵢ {Δ} A b) σ))} {El {Γ} (Πₙᵢ {Γ} A (λ α₁ → tr
  {_} {_} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ}
  {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} (b α₁) σ)))} (El[] {Γ} {Δ} {σ} {Πₙᵢ
  {Δ} A b}) (ap {_} {_} {Tm Γ (U {Γ})} {Ty Γ} (El {Γ}) {tr {_}
  {_} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ}
  {σ}) (_[_]t {Γ} {Δ} {U {Δ}} (Πₙᵢ {Δ} A b) σ)} {Πₙᵢ {Γ} A (λ α₁ → tr
  {_} {_} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ}
  {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} (b α₁) σ))} (Πₙᵢ[] {Γ} {Δ} {σ} {A}
  {b}))) (_[_]t {Γ} {Δ} {El {Δ} (Πₙᵢ {Δ} A b)} t σ)) α)
appₙᵢ[]{Γ}{Δ} {σ} {A} {b} t α = refl

-- Identity (with only transport)
--------------------------------------------------------------------------------

_^El_ :
  {Γ Δ : Con} (σ : Sub Γ Δ) (a : Tm Δ (U {Δ}))
  → Sub (Γ ▶ El {Γ}
           (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}}
               (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ)))
        (Δ ▶ El {Δ} a)
_^El_ {Γ}{Δ} (σᴬ , σᴰ , σᴹ , σˢ) a =
  (λ γ       → σᴬ (₁ γ) , ₂ γ) ,
  (λ γ γᴰ    → σᴰ (₁ γ) (₁ γᴰ) , ₂ γᴰ) ,
  (λ γ₀ γ₁ γᴹ → (σᴹ _ _ (₁ γᴹ)) , ₂ γᴹ) ,
  (λ γ γᴰ γˢ → σˢ _ _ (₁ γˢ) , ₂ γˢ)

infixl 5 _^El_

Id : ∀ {Γ}(a : Tm Γ U) → Tm Γ (El a) → Tm Γ (El a) → Tm Γ U
Id (aᴬ , aᴰ , aᴹ , aˢ) (tᴬ , tᴰ , tᴹ , tˢ) (uᴬ , uᴰ , uᴹ , uˢ) =
  (λ γ → lower (tᴬ γ) ≡ lower (uᴬ γ)) ,
  (λ γ γᴰ eq → tr (aᴰ γ γᴰ) eq (lower (tᴰ γ γᴰ)) ≡ lower (uᴰ γ γᴰ)) ,
  (λ γ₀ γ₁ γᴹ → lift λ e →
      lower (tᴹ _ _ γᴹ) ⁻¹
    ◾ ap (lower (aᴹ _ _ γᴹ)) e
    ◾ lower (uᴹ _ _ γᴹ)) ,
  (λ γ γᴰ γˢ eq →
      ap (tr (aᴰ γ γᴰ) eq) (tˢ γ γᴰ γˢ ⁻¹)
    ◾ apd (aˢ γ γᴰ γˢ) eq
    ◾ uˢ γ γᴰ γˢ)

Id[] :
  {Γ Δ : Con} {σ : Sub Γ Δ} {a : Tm Δ (U {Δ})} {t u : Tm Δ (El {Δ} a)}
  → _≡_ {j} {Tm Γ (U {Γ})} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U
  {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} (Id {Δ} a t
  u) σ)) (Id {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ}
  {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ)) (tr {i} {j}
  {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i} {j} {Ty
  Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t
  {Γ} {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a}) (_[_]t {Γ} {Δ} {El {Δ}
  a} t σ)) (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El
  {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[]
  {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a})
  (_[_]t {Γ} {Δ} {El {Δ} a} u σ)))
Id[] = refl

Transp :
  {Γ : Con} {a : Tm Γ (U {Γ})} (P : Ty (Γ ▶ El {Γ} a))
  {t u : Tm Γ (El {Γ} a)} →
  Tm Γ (_[_]T {Γ} {Γ ▶ El {Γ} a} P (<_> {Γ} {El {Γ} a} t)) →
  Tm Γ (El {Γ} (Id {Γ} a t u)) →
  Tm Γ (_[_]T {Γ} {Γ ▶ El {Γ} a} P (<_> {Γ} {El {Γ} a} u))
Transp {Γᴬ , Γᴰ , Γᴹ , Γˢ}{aᴬ , aᴰ , aᴹ , aˢ}
       (Pᴬ , Pᴰ , Pᴹ , Pˢ){tᴬ , tᴰ , tᴹ , tˢ}
       {uᴬ , uᴰ , uᴹ , uˢ}
       (ptᴬ , ptᴰ , ptᴹ , ptˢ)
       (eqᴬ , eqᴰ , eqᴹ , eqˢ)
  = (λ γ → tr (λ uᴬ → Pᴬ (γ , lift uᴬ)) (eqᴬ γ .lower) (ptᴬ γ)) ,
    (λ γ γᴰ →
       tr (λ uᴰ → Pᴰ (γ , uᴬ γ) (γᴰ , lift uᴰ)
                    (tr (λ x → Pᴬ (γ , lift x)) (eqᴬ γ .lower) (ptᴬ γ)))
          (eqᴰ γ γᴰ .lower)
          (J (λ uᴬ eqᴬ →
                Pᴰ (γ , lift uᴬ)
                   (γᴰ , lift (tr (aᴰ γ γᴰ) eqᴬ (lower (tᴰ γ γᴰ))))
                   (tr (λ uᴬ → Pᴬ (γ , lift uᴬ)) eqᴬ (ptᴬ γ)))
           (ptᴰ γ γᴰ)
           (eqᴬ γ .lower))) ,
    (λ γ₀ γ₁ γᴹ →
      tr (λ eqᴬγ₁ → Pᴹ (γ₀ , uᴬ γ₀) (γ₁ , uᴬ γ₁) (γᴹ , uᴹ γ₀ γ₁ γᴹ)
                       (tr (λ uᴬ₁ → Pᴬ (γ₀ , lift uᴬ₁)) (eqᴬ γ₀ .lower) (ptᴬ γ₀))
                       (tr (λ uᴬ₁ → Pᴬ (γ₁ , lift uᴬ₁)) eqᴬγ₁           (ptᴬ γ₁)))
          (eqᴹ _ _ γᴹ .lower)
          (J (λ uᴬγ₁lwr uᴹlwr → Pᴹ (γ₀ , uᴬ γ₀) (γ₁ , lift uᴬγ₁lwr) (γᴹ , lift uᴹlwr)
                                (tr (λ uᴬ₁ → Pᴬ (γ₀ , lift uᴬ₁)) (eqᴬ γ₀ .lower) (ptᴬ γ₀))
                                (tr (λ uᴬ₁ → Pᴬ (γ₁ , lift uᴬ₁))
                                 (lower (tᴹ γ₀ γ₁ γᴹ) ⁻¹ ◾
                                  ap (lower (aᴹ γ₀ γ₁ γᴹ)) (lower (eqᴬ γ₀)) ◾ uᴹlwr)
                                 (ptᴬ γ₁)))
             (J (λ uᴬγ₀lwr eqᴬγ₀lwr →
                       Pᴹ (γ₀ , lift uᴬγ₀lwr)
                         (γ₁ , lift (lower (aᴹ γ₀ γ₁ γᴹ) uᴬγ₀lwr)) (γᴹ , lift refl)
                         (tr (λ uᴬ₁ → Pᴬ (γ₀ , lift uᴬ₁)) eqᴬγ₀lwr (ptᴬ γ₀))
                         (tr (λ uᴬ₁ → Pᴬ (γ₁ , lift uᴬ₁))
                          (lower (tᴹ γ₀ γ₁ γᴹ) ⁻¹ ◾
                           ap (lower (aᴹ γ₀ γ₁ γᴹ)) eqᴬγ₀lwr ◾ refl)
                          (ptᴬ γ₁)))
                 (-- tᴹ _ _ γᴹ .lower
                 J (λ tᴬγ₁lwr tᴹγᴹlwr →
                        (ptᴬγ₁ : Pᴬ (γ₁ , lift tᴬγ₁lwr))
                        (ptᴹγᴹ : Pᴹ (γ₀ , tᴬ γ₀) (γ₁ , lift tᴬγ₁lwr) (γᴹ , lift tᴹγᴹlwr) (ptᴬ γ₀) ptᴬγ₁)
                        →
                        Pᴹ (γ₀ , lift (lower (tᴬ γ₀)))
                           (γ₁ , lift (lower (aᴹ γ₀ γ₁ γᴹ) (lower (tᴬ γ₀)))) (γᴹ , lift refl)
                           (ptᴬ γ₀)
                           (tr (λ uᴬ₁ → Pᴬ (γ₁ , lift uᴬ₁)) (tᴹγᴹlwr ⁻¹ ◾ refl)
                            ptᴬγ₁))
                    (λ _ ptᴹγᴹ → ptᴹγᴹ)
                    (tᴹ _ _ γᴹ .lower)
                    (ptᴬ γ₁) (ptᴹ _ _ γᴹ))
                 (eqᴬ γ₀ .lower))
             (uᴹ _ _ γᴹ .lower))) ,
    (λ γ γᴰ γˢ →
      tr
        (λ eqᴰ →
          Pˢ (γ , uᴬ γ) (γᴰ , uᴰ γ γᴰ) (γˢ , uˢ γ γᴰ γˢ)
          (tr (λ uᴬ₁ → Pᴬ (γ , lift uᴬ₁)) (eqᴬ γ .lower) (ptᴬ γ))
          (tr
           (λ uᴰ₁ →
              Pᴰ (γ , uᴬ γ) (γᴰ , lift uᴰ₁)
              (tr (λ x → Pᴬ (γ , lift x)) (eqᴬ γ .lower) (ptᴬ γ)))
           eqᴰ
           (J
            (λ uᴬ₁ eqᴬ₁ →
               Pᴰ (γ , lift uᴬ₁)
               (γᴰ , lift (tr (aᴰ γ γᴰ) eqᴬ₁ (lower (tᴰ γ γᴰ))))
               (tr (λ uᴬ₂ → Pᴬ (γ , lift uᴬ₂)) eqᴬ₁ (ptᴬ γ)))
            (ptᴰ γ γᴰ) (eqᴬ γ .lower))))
         (eqˢ γ γᴰ γˢ)
         (J (λ uᴰ uˢ →
               Pˢ (γ , uᴬ γ) (γᴰ , lift uᴰ) (γˢ , uˢ)
                     (tr (λ uᴬ₁ → Pᴬ (γ , lift uᴬ₁)) (eqᴬ γ .lower) (ptᴬ γ))
                     (tr
                      (λ uᴰ₁ →
                         Pᴰ (γ , uᴬ γ) (γᴰ , lift uᴰ₁)
                         (tr (λ x → Pᴬ (γ , lift x)) (eqᴬ γ .lower) (ptᴬ γ)))
                      (ap (tr (aᴰ γ γᴰ) (lower (eqᴬ γ))) (tˢ γ γᴰ γˢ ⁻¹) ◾
                       apd (aˢ γ γᴰ γˢ) (lower (eqᴬ γ)) ◾ uˢ)
                      (J
                       (λ uᴬ₁ eqᴬ₁ →
                          Pᴰ (γ , lift uᴬ₁)
                          (γᴰ , lift (tr (aᴰ γ γᴰ) eqᴬ₁ (lower (tᴰ γ γᴰ))))
                          (tr (λ uᴬ₂ → Pᴬ (γ , lift uᴬ₂)) eqᴬ₁ (ptᴬ γ)))
                       (ptᴰ γ γᴰ) (eqᴬ γ .lower))))
            (J (λ uᴬ eqᴬ →
                   Pˢ (γ , lift uᴬ) (γᴰ , lift (aˢ γ γᴰ γˢ uᴬ))
                   (γˢ , refl)
                   (tr (λ uᴬ₁ → Pᴬ (γ , lift uᴬ₁)) eqᴬ (ptᴬ γ))
                   (tr
                    (λ uᴰ₁ →
                       Pᴰ (γ , lift uᴬ) (γᴰ , lift uᴰ₁)
                       (tr (λ x → Pᴬ (γ , lift x)) eqᴬ (ptᴬ γ)))
                    (ap (tr (aᴰ γ γᴰ) eqᴬ) (tˢ γ γᴰ γˢ ⁻¹) ◾
                     apd (aˢ γ γᴰ γˢ) eqᴬ ◾ refl)
                    (J
                     (λ uᴬ₁ eqᴬ₁ →
                        Pᴰ (γ , lift uᴬ₁)
                        (γᴰ , lift (tr (aᴰ γ γᴰ) eqᴬ₁ (lower (tᴰ γ γᴰ))))
                        (tr (λ uᴬ₂ → Pᴬ (γ , lift uᴬ₂)) eqᴬ₁ (ptᴬ γ)))
                     (ptᴰ γ γᴰ) eqᴬ)))
                (J (λ tᴰ tˢ →
                     (ptᴰ : Pᴰ (γ , tᴬ γ) (γᴰ , lift tᴰ) (ptᴬ γ))
                     (ptˢ : Pˢ (γ , tᴬ γ) (γᴰ , lift tᴰ) (γˢ , tˢ) (ptᴬ γ) ptᴰ)
                     →
                     Pˢ (γ , tᴬ γ)
                     (γᴰ , lift (aˢ γ γᴰ γˢ (lower (tᴬ γ)))) (γˢ , refl) (ptᴬ γ)
                     (tr
                      (λ uᴰ₁ → Pᴰ (γ , tᴬ γ) (γᴰ , lift uᴰ₁) (ptᴬ γ))
                      (ap (λ b₀ → b₀) (tˢ ⁻¹) ◾ refl) ptᴰ))
                    (λ ptᴰ ptˢ → ptˢ)
                    (tˢ γ γᴰ γˢ) (ptᴰ γ γᴰ) (ptˢ γ γᴰ γˢ))
                (eqᴬ γ .lower))
            (uˢ γ γᴰ γˢ)))

<>∘ :
  {Γ Δ : Con} (σ : Sub Γ Δ) (a : Tm Δ (U {Δ})) → (t : Tm Δ (El {Δ} a)) → _≡_ {j}
  {Sub Γ (Δ ▶ El {Δ} a)} (_∘_ {Γ} {Δ} {Δ ▶ El {Δ} a} (<_> {Δ} {El {Δ} a} t) σ)
  (_∘_ {Γ} {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U
  {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} {Δ ▶ El {Δ} a} (_^El_ {Γ}
  {Δ} σ a) (<_> {Γ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ}
  {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (tr {i} {j} {Ty Γ} (Tm
  Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ}
  {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[]
  {Γ} {Δ} {σ} {a}) (_[_]t {Γ} {Δ} {El {Δ} a} t σ))))
<>∘ {Γ}{Δ} σ a t = refl

Transp[] :
  {Γ Δ : Con} {σ : Sub Γ Δ} {a : Tm Δ (U {Δ})} (P : Ty (Δ ▶ El {Δ} a))
  {t u : Tm Δ (El {Δ} a)} (pt : Tm Δ (_[_]T {Δ} {Δ ▶ El {Δ} a} P (<_>
  {Δ} {El {Δ} a} t))) (eq : Tm Δ (El {Δ} (Id {Δ} a t u))) → _≡_ {j} {Tm
  Γ (_[_]T {Γ} {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U
  {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (_[_]T
  {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U
  {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} {Δ ▶ El {Δ} a} P
  (_^El_ {Γ} {Δ} σ a)) (<_> {Γ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T
  {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a
  σ))} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El {Γ}
  (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ}
  {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a}) (_[_]t
  {Γ} {Δ} {El {Δ} a} u σ))))} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ}
  (_[_]T {Δ} {Δ ▶ El {Δ} a} P (<_> {Δ} {El {Δ} a} u)) σ} {_[_]T {Γ} {Γ ▶
  El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}}
  (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (_[_]T {Γ ▶ El {Γ} (tr
  {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ}
  {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} {Δ ▶ El {Δ} a} P (_^El_ {Γ} {Δ} σ
  a)) (<_> {Γ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ})
  σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (tr {i} {j}
  {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i} {j} {Ty Γ}
  (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ}
  {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a}) (_[_]t {Γ} {Δ} {El {Δ} a} u
  σ)))} (_◾_ {i} {Ty Γ} {_[_]T {Γ} {Δ} (_[_]T {Δ} {Δ ▶ El {Δ} a} P (<_>
  {Δ} {El {Δ} a} u)) σ} {_[_]T {Γ} {Δ ▶ El {Δ} a} P (_∘_ {Γ} {Δ} {Δ ▶ El
  {Δ} a} (<_> {Δ} {El {Δ} a} u) σ)} {_[_]T {Γ} {Γ ▶ El {Γ} (tr {i} {j}
  {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ})
  (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (_[_]T {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ}
  (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ}
  {Δ} {U {Δ}} a σ))} {Δ ▶ El {Δ} a} P (_^El_ {Γ} {Δ} σ a)) (<_> {Γ} {El
  {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[]
  {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (tr {i} {j} {Ty Γ} (Tm Γ)
  {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T
  {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a
  σ))} (El[] {Γ} {Δ} {σ} {a}) (_[_]t {Γ} {Δ} {El {Δ} a} u σ)))} ([][]T
  {Γ} {Δ} {Δ ▶ El {Δ} a} {P} {σ} {<_> {Δ} {El {Δ} a} u}) (_◾_ {i} {Ty
  Γ} {_[_]T {Γ} {Δ ▶ El {Δ} a} P (_∘_ {Γ} {Δ} {Δ ▶ El {Δ} a} (<_> {Δ}
  {El {Δ} a} u) σ)} {_[_]T {Γ} {Δ ▶ El {Δ} a} P (_∘_ {Γ} {Γ ▶ El {Γ} (tr
  {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ}
  {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} {Δ ▶ El {Δ} a} (_^El_ {Γ} {Δ} σ a)
  (<_> {Γ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ}
  {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (tr {i} {j}
  {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i} {j} {Ty Γ}
  (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ}
  {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a}) (_[_]t {Γ} {Δ} {El {Δ} a} u
  σ))))} {_[_]T {Γ} {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ}
  (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))}
  (_[_]T {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ}
  {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} {Δ ▶ El {Δ} a}
  P (_^El_ {Γ} {Δ} σ a)) (<_> {Γ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ)
  {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U
  {Δ}} a σ))} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El
  {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[]
  {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a})
  (_[_]t {Γ} {Δ} {El {Δ} a} u σ)))} (ap {j} {i} {Sub Γ (Δ ▶ El {Δ} a)}
  {Ty Γ} (_[_]T {Γ} {Δ ▶ El {Δ} a} P) {_∘_ {Γ} {Δ} {Δ ▶ El {Δ} a} (<_>
  {Δ} {El {Δ} a} u) σ} {_∘_ {Γ} {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ)
  {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U
  {Δ}} a σ))} {Δ ▶ El {Δ} a} (_^El_ {Γ} {Δ} σ a) (<_> {Γ} {El {Γ} (tr
  {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ}
  {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T
  {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ}
  (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))}
  (El[] {Γ} {Δ} {σ} {a}) (_[_]t {Γ} {Δ} {El {Δ} a} u σ)))} (<>∘ {Γ} {Δ}
  σ a u)) (_⁻¹ {i} {Ty Γ} {_[_]T {Γ} {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm
  Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ}
  {U {Δ}} a σ))} (_[_]T {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ}
  {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))}
  {Δ ▶ El {Δ} a} P (_^El_ {Γ} {Δ} σ a)) (<_> {Γ} {El {Γ} (tr {i} {j} {Ty
  Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t
  {Γ} {Δ} {U {Δ}} a σ))} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El
  {Δ} a) σ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ}
  {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ}
  {σ} {a}) (_[_]t {Γ} {Δ} {El {Δ} a} u σ)))} {_[_]T {Γ} {Δ ▶ El {Δ} a} P
  (_∘_ {Γ} {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ})
  σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} {Δ ▶ El {Δ}
  a} (_^El_ {Γ} {Δ} σ a) (<_> {Γ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ)
  {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U
  {Δ}} a σ))} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El
  {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[]
  {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a})
  (_[_]t {Γ} {Δ} {El {Δ} a} u σ))))} ([][]T {Γ} {Γ ▶ El {Γ} (tr {i} {j}
  {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ})
  (_[_]t {Γ} {Δ} {U {Δ}} a σ))} {Δ ▶ El {Δ} a} {P} {<_> {Γ} {El {Γ} (tr
  {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ}
  {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T
  {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ}
  (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))}
  (El[] {Γ} {Δ} {σ} {a}) (_[_]t {Γ} {Δ} {El {Δ} a} u σ))} {_^El_ {Γ} {Δ}
  σ a})))) (_[_]t {Γ} {Δ} {_[_]T {Δ} {Δ ▶ El {Δ} a} P (<_> {Δ} {El {Δ}
  a} u)} (Transp {Δ} {a} P {t} {u} pt eq) σ)) (Transp {Γ} {tr {i} {j}
  {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ})
  (_[_]t {Γ} {Δ} {U {Δ}} a σ)} (_[_]T {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm
  Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ}
  {U {Δ}} a σ))} {Δ ▶ El {Δ} a} P (_^El_ {Γ} {Δ} σ a)) {tr {i} {j} {Ty
  Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm
  Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ}
  {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a}) (_[_]t {Γ} {Δ} {El {Δ} a} t σ)}
  {tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i}
  {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ})
  (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a}) (_[_]t {Γ} {Δ}
  {El {Δ} a} u σ)} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (_[_]T {Δ}
  {Δ ▶ El {Δ} a} P (<_> {Δ} {El {Δ} a} t)) σ} {_[_]T {Γ} {Γ ▶ El {Γ} (tr
  {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ}
  {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (_[_]T {Γ ▶ El {Γ} (tr {i} {j} {Ty
  Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t
  {Γ} {Δ} {U {Δ}} a σ))} {Δ ▶ El {Δ} a} P (_^El_ {Γ} {Δ} σ a)) (<_> {Γ}
  {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}}
  (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (tr {i} {j} {Ty Γ} (Tm
  Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ)
  {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U
  {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a}) (_[_]t {Γ} {Δ} {El {Δ} a} t σ)))}
  (_◾_ {i} {Ty Γ} {_[_]T {Γ} {Δ} (_[_]T {Δ} {Δ ▶ El {Δ} a} P (<_> {Δ}
  {El {Δ} a} t)) σ} {_[_]T {Γ} {Δ ▶ El {Δ} a} P (_∘_ {Γ} {Δ} {Δ ▶ El {Δ}
  a} (<_> {Δ} {El {Δ} a} t) σ)} {_[_]T {Γ} {Γ ▶ El {Γ} (tr {i} {j} {Ty
  Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t
  {Γ} {Δ} {U {Δ}} a σ))} (_[_]T {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ)
  {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U
  {Δ}} a σ))} {Δ ▶ El {Δ} a} P (_^El_ {Γ} {Δ} σ a)) (<_> {Γ} {El {Γ} (tr
  {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ}
  {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T
  {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ}
  (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))}
  (El[] {Γ} {Δ} {σ} {a}) (_[_]t {Γ} {Δ} {El {Δ} a} t σ)))} ([][]T {Γ}
  {Δ} {Δ ▶ El {Δ} a} {P} {σ} {<_> {Δ} {El {Δ} a} t}) (_◾_ {i} {Ty Γ}
  {_[_]T {Γ} {Δ ▶ El {Δ} a} P (_∘_ {Γ} {Δ} {Δ ▶ El {Δ} a} (<_> {Δ} {El
  {Δ} a} t) σ)} {_[_]T {Γ} {Δ ▶ El {Δ} a} P (_∘_ {Γ} {Γ ▶ El {Γ} (tr {i}
  {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ})
  (_[_]t {Γ} {Δ} {U {Δ}} a σ))} {Δ ▶ El {Δ} a} (_^El_ {Γ} {Δ} σ a) (<_>
  {Γ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U
  {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (tr {i} {j} {Ty
  Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm
  Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ}
  {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a}) (_[_]t {Γ} {Δ} {El {Δ} a} t
  σ))))} {_[_]T {Γ} {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ}
  (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))}
  (_[_]T {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ}
  {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} {Δ ▶ El {Δ} a}
  P (_^El_ {Γ} {Δ} σ a)) (<_> {Γ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ)
  {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U
  {Δ}} a σ))} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El
  {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[]
  {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a})
  (_[_]t {Γ} {Δ} {El {Δ} a} t σ)))} (ap {j} {i} {Sub Γ (Δ ▶ El {Δ} a)}
  {Ty Γ} (_[_]T {Γ} {Δ ▶ El {Δ} a} P) {_∘_ {Γ} {Δ} {Δ ▶ El {Δ} a} (<_>
  {Δ} {El {Δ} a} t) σ} {_∘_ {Γ} {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ)
  {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U
  {Δ}} a σ))} {Δ ▶ El {Δ} a} (_^El_ {Γ} {Δ} σ a) (<_> {Γ} {El {Γ} (tr
  {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ}
  {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T
  {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ}
  (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))}
  (El[] {Γ} {Δ} {σ} {a}) (_[_]t {Γ} {Δ} {El {Δ} a} t σ)))} (<>∘ {Γ} {Δ}
  σ a t)) (_⁻¹ {i} {Ty Γ} {_[_]T {Γ} {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm
  Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ}
  {U {Δ}} a σ))} (_[_]T {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ}
  {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))}
  {Δ ▶ El {Δ} a} P (_^El_ {Γ} {Δ} σ a)) (<_> {Γ} {El {Γ} (tr {i} {j} {Ty
  Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t
  {Γ} {Δ} {U {Δ}} a σ))} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El
  {Δ} a) σ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ}
  {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ}
  {σ} {a}) (_[_]t {Γ} {Δ} {El {Δ} a} t σ)))} {_[_]T {Γ} {Δ ▶ El {Δ} a} P
  (_∘_ {Γ} {Γ ▶ El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ})
  σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} {Δ ▶ El {Δ}
  a} (_^El_ {Γ} {Δ} σ a) (<_> {Γ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ)
  {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U
  {Δ}} a σ))} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El
  {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[]
  {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a})
  (_[_]t {Γ} {Δ} {El {Δ} a} t σ))))} ([][]T {Γ} {Γ ▶ El {Γ} (tr {i} {j}
  {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ})
  (_[_]t {Γ} {Δ} {U {Δ}} a σ))} {Δ ▶ El {Δ} a} {P} {<_> {Γ} {El {Γ} (tr
  {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ}
  {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T
  {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ}
  (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))}
  (El[] {Γ} {Δ} {σ} {a}) (_[_]t {Γ} {Δ} {El {Δ} a} t σ))} {_^El_ {Γ} {Δ}
  σ a})))) (_[_]t {Γ} {Δ} {_[_]T {Δ} {Δ ▶ El {Δ} a} P (<_> {Δ} {El {Δ}
  a} t)} pt σ)) (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} (Id {Δ}
  a t u)) σ} {El {Γ} (Id {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U
  {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ)) (tr {i}
  {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i} {j} {Ty
  Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t
  {Γ} {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a}) (_[_]t {Γ} {Δ} {El {Δ}
  a} t σ)) (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El
  {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[]
  {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a})
  (_[_]t {Γ} {Δ} {El {Δ} a} u σ)))} (_◾_ {i} {Ty Γ} {_[_]T {Γ} {Δ} (El
  {Δ} (Id {Δ} a t u)) σ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ}
  {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} (Id
  {Δ} a t u) σ))} {El {Γ} (Id {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ}
  {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))
  (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i}
  {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ})
  (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a}) (_[_]t {Γ} {Δ}
  {El {Δ} a} t σ)) (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a)
  σ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}}
  (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a})
  (_[_]t {Γ} {Δ} {El {Δ} a} u σ)))} (El[] {Γ} {Δ} {σ} {Id {Δ} a t u})
  (ap {j} {i} {Tm Γ (U {Γ})} {Ty Γ} (El {Γ}) {tr {i} {j} {Ty Γ} (Tm Γ)
  {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U
  {Δ}} (Id {Δ} a t u) σ)} {Id {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ}
  {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))
  (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a) σ} {El {Γ} (tr {i}
  {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}} (U[] {Γ} {Δ} {σ})
  (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a}) (_[_]t {Γ} {Δ}
  {El {Δ} a} t σ)) (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (El {Δ} a)
  σ} {El {Γ} (tr {i} {j} {Ty Γ} (Tm Γ) {_[_]T {Γ} {Δ} (U {Δ}) σ} {U {Γ}}
  (U[] {Γ} {Δ} {σ}) (_[_]t {Γ} {Δ} {U {Δ}} a σ))} (El[] {Γ} {Δ} {σ} {a})
  (_[_]t {Γ} {Δ} {El {Δ} a} u σ))} (Id[] {Γ} {Δ} {σ} {a} {t} {u})))
  (_[_]t {Γ} {Δ} {El {Δ} (Id {Δ} a t u)} eq σ)))
Transp[] {Γ}{Δ}{σ}{a} P {t}{u} pt eq = refl
-}

ap→ : ∀{ℓ ℓ'}{A B : Set ℓ}{f : A → Set ℓ'}{g : B → Set ℓ'}(e : A ≡ B){a : A} →
  tr (λ x → x → Set ℓ') e f ≡ g → f a ≡ g (coe e a)
ap→ refl {a} = ap (λ h → h a)

ap2' :
  ∀ {i j k}{A : Set i}{B : Set j}{C : Set k}(f : A → B → C)
    {a₀ : A}{a₁ : A}(a₂ : a₀ ≡ a₁)
    {b₀ : B}{b₁ : B}(b₂ : b₀ ≡ b₁)
  → f a₀ b₀ ≡ f a₁ b₁
ap2' f refl refl = refl

IdU : ∀{Γ}(a b : Tm Γ U) → Ty Γ
IdU {Γᴬ , Γᴰ , Γᴹ , Γˢ} (aᴬ , aᴰ , aᴹ , aˢ) (bᴬ , bᴰ , bᴹ , bˢ) =
  (λ γ → aᴬ γ ≡ bᴬ γ) ,
--  (λ γ γᴰ eq → (α : aᴬ γ) → aᴰ γ γᴰ α ≡ bᴰ γ γᴰ (coe eq α)) ,
  (λ γ γᴰ eq → tr (λ x → x → Set ℓ) eq (aᴰ γ γᴰ) ≡ bᴰ γ γᴰ) ,
  (λ γ₀ γ₁ γᴹ eq₀ eq₁ → coe (ap2' (λ A B → Lift (A → B)){aᴬ γ₀}{bᴬ γ₀} eq₀ {aᴬ γ₁}{bᴬ γ₁} eq₁) (aᴹ γ₀ γ₁ γᴹ) ≡ (bᴹ γ₀ γ₁ γᴹ) ) ,
--  λ γ γᴰ γˢ eq eqᴰ → (α : aᴬ γ) → bˢ γ γᴰ γˢ (coe eq α) ≡ coe (eqᴰ α) (aˢ γ γᴰ γˢ α)
  λ γ γᴰ γˢ eq eqᴰ → (α : aᴬ γ) → bˢ γ γᴰ γˢ (coe eq α) ≡ coe (ap→ eq eqᴰ) (aˢ γ γᴰ γˢ α)

IdU[] : ∀{Γ}{a b : Tm Γ U}{Θ}{σ : Sub Θ Γ} →
  IdU a b [ σ ]T ≡
  IdU (tr (Tm Θ) (U[] {Θ}{Γ}{σ}) (_[_]t {Θ}{Γ}{U} a σ))
      (tr (Tm Θ) (U[] {Θ}{Γ}{σ}) (_[_]t {Θ}{Γ}{U} b σ))
IdU[] = refl

reflU : ∀{Γ}(a : Tm Γ U) → Tm Γ (IdU a a)
reflU {Γᴬ , Γᴰ , Γᴹ , Γˢ} (aᴬ , aᴰ , aᴹ , aˢ) =
  (λ γ → refl) ,
  (λ γ γᴰ → refl) ,
  (λ γ₀ γ₁ γᴹ → refl) ,
  λ γ γᴰ γˢ α → refl

reflU[] : ∀{Γ}{a : Tm Γ U}{Θ}{σ : Sub Θ Γ} →
  tr (Tm Θ) (IdU[] {Γ}{a}{a}{Θ}{σ}) (_[_]t {Θ}{Γ}{IdU a a} (reflU a) σ) ≡ reflU (tr (Tm Θ) (U[] {Θ}{Γ}{σ}) (_[_]t {Θ}{Γ}{U} a σ))
reflU[] = refl

TranspU : ∀{Γ}{a b : Tm Γ U}(p : Tm (Γ ▶ U) U)(pa : Tm Γ (El p [ <_> {Γ}{U} a ]T))(eq : Tm Γ (IdU a b)) → Tm Γ (El p [ <_> {Γ}{U} b ]T)
TranspU {Γᴬ , Γᴰ , Γᴹ , Γˢ}{aᴬ , aᴰ , aᴹ , aˢ}{bᴬ , bᴰ , bᴹ , bˢ}(pᴬ , pᴰ , pᴹ , pˢ)(paᴬ , paᴰ , paᴹ , paˢ)(eᴬ , eᴰ , eᴹ , eˢ) =
  (λ γ → lift (tr (λ x → pᴬ (γ , x)) (eᴬ γ) (lower (paᴬ γ)))) ,
  (λ γ γᴰ → lift (tr (λ z → pᴰ (γ , bᴬ γ) (γᴰ , z) (tr (λ x → pᴬ (γ , x)) (eᴬ γ) (lower (paᴬ γ))))
                     (eᴰ γ γᴰ)
                     (J (λ z e → pᴰ (γ , z) (γᴰ , tr (λ x → x → Set ℓ) e (aᴰ γ γᴰ)) (tr (λ x → pᴬ (γ , x)) e (lower (paᴬ γ)))) (lower (paᴰ γ γᴰ)) (eᴬ γ)))) ,
  (λ γ₀ γ₁ γᴹ → lift ( ap (λ z → z (lower (paᴬ γ₀))){λ z → lower (pᴹ (γ₀ , bᴬ γ₀) (γ₁ , bᴬ γ₁) (γᴹ , bᴹ γ₀ γ₁ γᴹ)) (tr (λ x → pᴬ (γ₀ , x)) (eᴬ γ₀) z)}{λ z → tr (λ x → pᴬ (γ₁ , x)) (eᴬ γ₁) (lower (pᴹ (γ₀ , aᴬ γ₀) (γ₁ , aᴬ γ₁) (γᴹ , aᴹ γ₀ γ₁ γᴹ)) z)}
                          (ext λ z → {!!})
                     ◾ ap (tr (λ x → pᴬ (γ₁ , x)) (eᴬ γ₁)) (lower (paᴹ γ₀ γ₁ γᴹ)))) ,
  -- lower (paᴹ γ₀ γ₁ γᴹ)
  -- lower (eᴹ γ₀ γ₁ γᴹ)
  {!!}

